const yup = require("yup");

exports.schema = yup.object().shape({
  // userName: yup
  //   .string()
  //   .required("نام کاربری الزامی میباشد")
  //   .min(4, "حداقل طول نام کاربری 4 کاراکتر است")
  //   .max(255, "حداکثر طول نام کاربری حداکثر 255 کاراکتر است"),
  // fullName: yup
  //   .string()
  //   .required("نام و نام خانوادگی الزامی میباشد")
  //   .min(4, "حداقل طول نام و نام خانوادگی 4 کاراکتر است")
  //   .max(255, "حداکثر طول نام و نام خانوادگی حداکثر 255 کاراکتر است"),
  password: yup
    .string()
    .required("کلمه عبور الزامی میباشد")
    .min(4, "حداقل طول کلمه عبور 4 کاراکتر است")
    .max(255, "حداکثر طول کلمه عبور حداکثر 255 کاراکتر است"),
  confirmPassword: yup
    .string()
    .oneOf(
      [yup.ref("password"), null],
      "تکرار کلمه عبورf با کلمه عبور یکسان نمیباشد"
    ),
  email: yup
    .string()
    .required("ایمیل الزامی میباشد")
    .email("ایمیل وارد شده معتبر نمیباشد"),
  // phoneNumber: yup
  //   .number()
  //   .required("شماره تلفن الزامی میباشد")
  //   .min(11, "شماره تلفن باید 11 رقمی باشد")
  //   .max(11, "شماره تلفن باید 11 رقمی باشد"),
});
